000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОтправленныеСобытия_еСпутник/ОтправленныеСобытия_еСпутник.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтправленныеСобытия_еСпутник</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТипСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОтправленныеСобытия_еСпутник/ManagerModule.bsl
Функция ПроверитьОбновитьТипСобытияДокумента(Документ, ТипСобытия, СтатусДокумента) Экспорт 
	
	НаборЗаписей = РегистрыСведений.ОтправленныеСобытия_еСпутник.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Документ.Установить(Документ, Истина);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда 
		
		Запись = НаборЗаписей.Добавить();
		
		Запись.Активность 	= Истина; 
		Запись.Период		= ТекущаяДата();
		Запись.Документ		= Документ;
		Запись.ТипСобытия	= ТипСобытия;
		Запись.СтатусДокумента	= СтатусДокумента;
		
		НаборЗаписей.Записать(); 
		
		Возврат Истина;
		
	Иначе
		
		Запись = НаборЗаписей.Получить(0);
		
		Если СокрЛП(Запись.ТипСобытия) = СокрЛП(ТипСобытия) Тогда 
			Возврат Ложь
		КонецЕсли;	
		
		Запись.Активность 	= Истина; 
		Запись.Период		= ТекущаяДата();
		Запись.Документ		= Документ;
		Запись.ТипСобытия	= ТипСобытия;
		Запись.СтатусДокумента	= СтатусДокумента;
		
		НаборЗаписей.Записать(); 
		
		Возврат Истина;
		
	КонецЕсли;	
	
КонецФункции
